{"keras_version": "2.1.3", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "valid", "use_bias": true, "activation": "relu", "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "batch_input_shape": [null, 36, 36, 1], "bias_constraint": null, "filters": 32, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "rate": 0.25, "trainable": true, "seed": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 128, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "dense_1", "kernel_constraint": null, "use_bias": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_2", "rate": 0.5, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"activation": "softmax", "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 58, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "dense_2", "kernel_constraint": null, "use_bias": true}}], "backend": "tensorflow"}